Revit 2027 API
StringParameterValue(String) Constructor
 Value constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StringParameterValue(
	string value
)
Public Sub New (
	value As String
)
public:
StringParameterValue(
	String^ value
)
new :
        value : string -> StringParameterValue
Parameters
value String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StringParameterValue Class
StringParameterValue Overload
Autodesk.Revit.DB Namespace